Repository: yaolin-dev/OKVideoMac
Catalog: OKVideoMac/macOS/OKVideoMac/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# error.common.content-unavailable
source: This content cannot be opened from the current provider.
zh_hans: 当前站点无法打开该内容。

# error.common.database
source: The local database operation failed. Export diagnostics if the problem continues.
zh_hans: 本地数据库操作失败，如问题持续请导出诊断。

# error.common.decoding
source: The returned data could not be processed. Try another provider or try again later.
zh_hans: 返回的数据无法处理，请稍后重试或更换站点。

# error.common.filesystem
source: The file operation failed. Check the selected file or folder and try again.
zh_hans: 文件操作失败，请检查所选文件或文件夹后重试。

# error.common.live
source: The Live TV operation could not be completed.
zh_hans: 无法完成直播操作。

# error.common.network
source: The network request failed. Check your connection and try again.
zh_hans: 网络请求失败，请检查网络连接后重试。

# error.common.parsing
source: The playback address could not be resolved. Try another stream or provider.
zh_hans: 无法解析播放地址，请切换线路或站点。

# error.common.playback
source: Playback could not be started or completed.
zh_hans: 无法开始或完成播放。

# error.common.provider-script
source: The provider script could not complete the request.
zh_hans: 站点脚本无法完成请求。

# error.common.site
source: The provider could not complete this request. Try again later or use another provider.
zh_hans: 当前站点无法完成请求，请稍后重试或更换站点。

# error.common.unsupported
source: This operation is not supported.
zh_hans: 暂不支持此操作。

# common.error-code
source: Error code %@
zh_hans: 错误码 %@

# common.http-status
source: HTTP status %lld
zh_hans: HTTP 状态码 %lld

# node.module-kind.comic
source: Comics
zh_hans: 漫画

# node.module-kind.music
source: Music
zh_hans: 音乐

# node.module-kind.pan
source: Cloud Drive
zh_hans: 网盘

# node.module-kind.read
source: Reading
zh_hans: 小说

# node.module-kind.video
source: Video
zh_hans: 影视

# node.runtime.failed.user-facing
source: Node Runtime is unavailable. Export diagnostics for details.
zh_hans: Node Runtime 暂不可用，请导出诊断查看详情。

# parser.type.unsupported
source: Parser %1$@ uses unsupported type %2$lld.
zh_hans: 解析器 %1$@ 的 type %2$lld 尚未实现

# parser.url.invalid
source: Web parser %@ generated an invalid URL.
zh_hans: Web 解析器 %@ 生成了非法 URL

# provider.card.discovery-only
source: This card provides discovery information only and has no video details.
zh_hans: 该卡片只提供发现信息，不包含影视详情

# provider.card.settings-only
source: This card performs a settings action and has no video details.
zh_hans: 该卡片执行的是设置操作，不包含影视详情

# provider.category.actions-required
source: A configuration category must load its actions first and cannot be opened as video details.
zh_hans: 配置分类必须先加载操作列表，不能作为影视详情打开

# provider.catpaw.route.unknown
source: Unknown CatPaw route: %@
zh_hans: 未知 CatPaw 路由：%@

# provider.cloud-proxy.error
source: Cloud-drive proxy (%1$@): %2$@
zh_hans: 网盘代理（%1$@）：%2$@

# provider.history.internal-reference
source: A CatPaw internal history reference cannot be used as a media URL. Refresh the current details first.
zh_hans: CatPaw 历史内部引用不能作为媒体地址，必须重新获取当前详情

# provider.history.source-id-missing
source: The history item is missing its original playback source identifier.
zh_hans: 历史记录缺少原播放线路标识

# provider.node.configuration.invalid
source: The Node provider configuration is invalid.
zh_hans: NodeHTTPSpiderSiteProvider 站点配置无效

# provider.node.method.failed
source: %1$@ %2$@ failed: %3$@
zh_hans: %1$@ %2$@ 失败：%3$@

# provider.node.request.failed
source: The %1$@ request to Node site %2$@ failed.
zh_hans: Node 站点 %2$@ 的 %1$@ 请求失败

# provider.node.response.not-json
source: The %1$@ response from Node site %2$@ is not valid JSON.
zh_hans: Node 站点 %2$@ 的 %1$@ 响应不是有效 JSON

# provider.playback.absolute-url-missing
source: The CatPaw playback response did not return a usable absolute media URL.
zh_hans: CatPaw 播放响应未返回可用的绝对媒体地址

# provider.playback.transport-url-missing
source: The CatPaw playback transport did not return a usable absolute media URL.
zh_hans: CatPaw 播放传输层未返回可用的绝对媒体地址

# provider.quark.token.encode.failed
source: Unable to encode the Quark share token.
zh_hans: 夸克分享令牌编码失败

# provider.quark.token.identifiers-missing
source: The Quark episode token is missing a share or file identifier.
zh_hans: 夸克分集令牌缺少分享或文件标识

# provider.quark.token.invalid
source: The Quark episode token is invalid, so share authorization cannot be refreshed.
zh_hans: 夸克分集令牌格式无效，无法刷新分享授权

# provider.quark.token.missing-new
source: The service did not return a new stoken; the share may have expired.
zh_hans: 接口未返回新 stoken，分享可能已失效

# provider.quark.token.refresh.failed-prefix
source: Unable to refresh the Quark share token: %@
zh_hans: 夸克分享令牌刷新失败：%@

# provider.quark.transfer-after-refresh.failed
source: %1$@ playback failed: the Quark share token was refreshed, but transfer still failed: %2$@
zh_hans: %1$@ 播放失败：夸克分享令牌已刷新，但转存仍失败：%2$@

# provider.search.failed
source: %1$@ search failed: %2$@
zh_hans: %1$@ 搜索失败：%2$@

# provider.search.route-unregistered
source: %@ search failed: this Bundle and Profile do not register a search route.
zh_hans: %@ search 失败：该 Bundle 与 Profile 已确认未注册搜索路由

# quickjs.arguments.encode.failed
source: Unable to encode Spider invocation arguments.
zh_hans: 无法编码 Spider 调用参数

# quickjs.callback.module-missing
source: Spider module callback parameters are missing.
zh_hans: Spider 模块回调参数缺失

# quickjs.callback.request-missing
source: Spider network callback parameters are missing.
zh_hans: Spider 网络回调参数缺失

# quickjs.frameworks.missing
source: The app bundle has no Frameworks folder.
zh_hans: 应用包没有 Frameworks 目录

# quickjs.invoke.failed
source: The QuickJS method call failed.
zh_hans: QuickJS 方法调用失败

# quickjs.library.missing
source: The app bundle is missing libOKQuickJS.dylib.
zh_hans: 应用包缺少 libOKQuickJS.dylib

# quickjs.load.failed
source: Unable to load QuickJS: %@
zh_hans: 无法加载 QuickJS：%@

# quickjs.module.http-status
source: Module %1$@ returned HTTP %2$lld.
zh_hans: 模块 %1$@ 返回 HTTP %2$lld

# quickjs.module.load.failed
source: Unable to load Spider module: %@
zh_hans: 无法加载 Spider 模块：%@

# quickjs.module.not-utf8
source: The Spider module is not UTF-8: %@
zh_hans: Spider 模块不是 UTF-8：%@

# quickjs.module.scheme.invalid
source: Spider modules must use HTTP/HTTPS: %@
zh_hans: Spider 模块只允许 HTTP/HTTPS：%@

# quickjs.module.too-large
source: The Spider module exceeds 5 MiB.
zh_hans: Spider 模块超过 5 MiB

# quickjs.network.failed
source: The Spider network request failed.
zh_hans: Spider 网络请求失败

# quickjs.network.no-result
source: The Spider network bridge returned no result.
zh_hans: Spider 网络桥没有返回结果

# quickjs.network.timeout
source: The Spider network bridge timed out.
zh_hans: Spider 网络桥超时

# quickjs.request.invalid
source: Spider request parameters must be a URL string or object.
zh_hans: Spider request 参数必须是 URL 字符串或对象

# quickjs.request.not-utf8
source: The Spider network request is not UTF-8.
zh_hans: Spider 网络请求不是 UTF-8

# quickjs.request.scheme.invalid
source: The Spider network bridge only allows HTTP/HTTPS.
zh_hans: Spider 网络桥只允许 HTTP/HTTPS

# quickjs.resource.denied
source: Access to Spider resource %@ is denied.
zh_hans: 禁止访问 Spider 资源：%@

# quickjs.response.encode.failed
source: Unable to encode the Spider network response.
zh_hans: 无法编码 Spider 网络响应

# quickjs.result.not-json
source: The QuickJS result is not JSON: %@
zh_hans: QuickJS 返回值不是 JSON：%@

# quickjs.result.not-utf8
source: The QuickJS result is not UTF-8.
zh_hans: QuickJS 返回值不是 UTF-8

# quickjs.runtime.create.failed
source: Unable to create the QuickJS Runtime.
zh_hans: 无法创建 QuickJS Runtime

# quickjs.runtime.script-not-loaded
source: The QuickJS Runtime has not loaded a script.
zh_hans: QuickJS Runtime 尚未载入脚本

# quickjs.script.load.failed
source: The QuickJS script failed to load.
zh_hans: QuickJS 脚本载入失败

# quickjs.symbol.missing
source: The QuickJS bridge is missing symbol %@.
zh_hans: QuickJS 桥缺少符号 %@

# web-sniffer.click-script.failed
source: Click script failed: %@
zh_hans: 点击脚本执行失败：%@

# web-sniffer.debug.title
source: OKVideoMac Web Sniffing Debugger
zh_hans: OKVideoMac Web 嗅探调试

# web-sniffer.local-address.denied
source: Web sniffing cannot access local or private-network addresses.
zh_hans: Web 嗅探拒绝访问本机或内网地址

# web-sniffer.navigation.failed
source: Web navigation failed: %@
zh_hans: 网页导航失败：%@

# web-sniffer.page-load.failed
source: Web page loading failed: %@
zh_hans: 网页加载失败：%@

# web-sniffer.scheme.invalid
source: Web sniffing only allows HTTP/HTTPS pages.
zh_hans: Web 嗅探只允许 HTTP/HTTPS 页面

# web-sniffer.timeout
source: Web sniffing timed out.
zh_hans: Web 嗅探超时

# android.runtime.rebuild.action
source: Back Up and Rebuild
zh_hans: 备份并重建

# android.runtime.rebuild.message
source: The current OKVideoMac Android Runtime will be moved to a recoverable backup, then rebuilt using an existing system image from the selected Android SDK. The runtime's internal state will be reset, and some cloud drives may require you to sign in or authorize again. OKVideoMac settings, favorites, and history will not be affected.
zh_hans: 当前 OKVideoMac 专用 Android Runtime 会先移到可恢复备份，再使用已选 Android SDK 中现有的 system image 重建。 Android Runtime 内部状态会重置，部分网盘可能需要重新登录或授权。OKVideoMac 的普通设置、收藏和历史不受影响。

# app.instance.conflict
source: Another OKVideoMac instance is running (%@). This instance did not open the shared database to protect your data. Close the older version or duplicate copy, then try again.
zh_hans: 检测到另一个 OKVideoMac 实例正在运行（%@）。为保护同一数据库，本实例没有打开数据库。请关闭旧版本或重复副本后重试。

# app.instance.database-in-use
source: Another OKVideoMac instance is using the application database. This instance did not open it to protect your data.
zh_hans: 另一个 OKVideoMac 实例正在使用应用数据库。为保护数据，本实例没有打开数据库。

# backup.read.failed
source: Unable to read the backup file: %@
zh_hans: 无法读取备份文件：%@

# backup.write.failed
source: Unable to write the backup file: %@
zh_hans: 无法写入备份文件：%@

# cloud.authorization.no-explicit-expiry
source: The playback URL could not be retrieved, but no explicit account-expiration signal was received. If authorization has not been completed, open the configuration page. After saving, only the current title will be verified once.
zh_hans: 播放地址获取失败，但没有收到明确的账号失效信号。如果尚未授权，可打开配置页；保存后将只验证当前影片一次。

# cloud.authorization.open-provider
source: Open %@ Authorization Settings
zh_hans: 打开%@授权配置

# configuration.catpaw.no-default
source: The current CatPaw resource does not provide a verifiable default configuration. Dynamic providers that depend on accounts or mounts might not appear.
zh_hans: 当前 CatPaw 资源未提供可验证的默认配置，依赖账号或挂载的动态站点可能不会出现。

# configuration.import.live-summary
source: %d Live TV configurations found; %d can be synced to Live TV Sources.%@
zh_hans: 另外发现 %d 个直播配置；其中 %d 个可同步到“直播源”。%@

# configuration.import.live-sync-summary
source: Live TV sync finished: %d added, %d skipped, %d failed.
zh_hans: 直播同步完成：新增 %d 个，跳过 %d 个，失败 %d 个。

# configuration.import.live-unsupported
source: %d dynamic Live TV plugins cannot be synced yet.
zh_hans: %d 个动态直播插件暂不支持同步。

# configuration.import.summary
source: %d providers found: %d require Android Bridge, %d use JavaScript, and %d use other built-in capabilities.
zh_hans: 共发现 %d 个站点：%d 个需要 Android Bridge，%d 个使用 JavaScript，%d 个使用其他内建能力。

# configuration.title
source: Video Providers
zh_hans: 点播片源

# diagnostics.export.failed
source: Unable to export diagnostics: %@
zh_hans: 无法导出诊断：%@

# live.source.pasted
source: Pasted Content
zh_hans: 粘贴内容

# node.runtime.restarting
source: Node Runtime restart attempt %1$lld: %2$@
zh_hans: Node Runtime 正在第 %1$lld 次恢复：%2$@

# player.audio-delay-value
source: Audio Delay %.1f sec
zh_hans: 音频延迟 %.1f 秒

# player.protocol.unsupported
source: The player does not support this media protocol: %@
zh_hans: 播放器不支持该媒体协议：%@

# player.quality.switch-and-restore.failed
source: %1$@ Restoring the previous quality also failed: %2$@
zh_hans: %1$@；恢复原清晰度也失败：%2$@

# player.seek.timeout.message
source: The player did not finish seeking within 10 seconds and returned to the previous position. The network or source may be slow; try again later or switch quality.
zh_hans: 播放器在 10 秒内没有完成跳转，已返回原播放位置。当前网络或线路响应较慢，请稍后重试或切换清晰度。

# player.stage.seeking-to
source: Seeking to %@
zh_hans: 正在跳转到 %@

# player.subtitle-delay-value
source: Delay · %.1f sec
zh_hans: 延迟 · %.1f 秒

# player.subtitle-earlier
source: Subtitles 0.5 Seconds Earlier
zh_hans: 字幕提前 0.5 秒

# provider.current-configuration.unavailable
source: %@ is unavailable in the current configuration.
zh_hans: 来源 %@ 在当前配置中不可用

# search.close-and-return-section
source: Close Search and Return to %@
zh_hans: 关闭搜索并返回%@

# search.failures.no-results
source: %d providers failed; the remaining providers returned no results.
zh_hans: %d 个站点搜索失败，其余站点没有返回结果。

# search.progress.message
source: First pages: %d/%d providers. Finished: %d/%d. Results appear as they arrive.
zh_hans: 首页进度：%d/%d 个站点。已完成：%d/%d。结果会随时显示。

# search.return-section
source: Return to %@
zh_hans: 返回%@

# sidebar.search.live.accessibility
source: Search live TV channels
zh_hans: 搜索直播频道

# sidebar.search.live.help
source: Filter channels in the current live TV source
zh_hans: 筛选当前直播源中的频道

# sidebar.search.live.placeholder
source: Search channels…
zh_hans: 搜索频道…

# sidebar.search.video.accessibility
source: Search videos
zh_hans: 搜索影片

# sidebar.search.video.help
source: Search all providers in the current configuration
zh_hans: 搜索当前配置中的全部站点

# sidebar.search.video.placeholder
source: Search videos…
zh_hans: 搜索影片…

# content.error.open.title
source: Unable to Open Content
zh_hans: 无法打开内容

# poster.invalid-image
source: The poster is not a valid image.
zh_hans: 海报不是有效图片

# provider.error.invalid-response.message
source: The current provider returned a result that could not be processed. Try again later or choose another provider.
zh_hans: 当前站点返回了无法处理的结果，请稍后重试或更换站点。

# provider.error.request.title
source: Provider Request Failed
zh_hans: 内容源请求失败

# provider.error.unresponsive.message
source: The current provider is temporarily unresponsive. Other providers remain available.
zh_hans: 当前站点暂时无响应，其他站点仍可继续使用。

# provider.load.failed
source: Provider Failed to Load
zh_hans: 站点加载失败

# provider.unavailable.history-preserved
source: Provider %@ is unavailable in the current configuration. The record will be preserved.
zh_hans: 来源 %@ 在当前配置中不可用，记录仍会保留

# provider.unavailable.title
source: Provider Unavailable
zh_hans: 来源不可用

# search.completion.cancelled
source: Search stopped.
zh_hans: 搜索已停止。

# search.completion.deadline
source: The initial search finished; background pagination reached its time limit.
zh_hans: 首轮搜索已完成；后台补页已到达时间上限。

# search.completion.empty
source: No providers in the current scope returned matching content.
zh_hans: 当前搜索范围内没有站点返回匹配内容。

# search.completion.superseded
source: A newer search replaced this search.
zh_hans: 本次搜索已被新搜索替代。

# search.duplicates.accessibility
source: Duplicate Title Display
zh_hans: 重复影片显示方式

# search.duplicates.label
source: Duplicate Titles
zh_hans: 重复影片

# search.duplicates.merge
source: Merge Duplicates
zh_hans: 合并重复

# search.duplicates.merge.help
source: Combine results with the same title and year into one card
zh_hans: 将片名和年份相同的跨站结果合并为一张卡片

# search.duplicates.separate
source: Show Separately
zh_hans: 分别显示

# search.duplicates.separate.help
source: Show a separate result for each provider
zh_hans: 按来源分别显示搜索结果

# search.empty.no-results.title
source: No Results
zh_hans: 暂无结果

# search.empty.start.message
source: Enter a title to search the enabled providers in the current scope.
zh_hans: 输入关键词后将并发搜索当前范围内已启用的站点。

# search.empty.start.title
source: Search Movies and Shows
zh_hans: 搜索影视内容

# search.failure.configuration
source: Configuration or Sign-In Required
zh_hans: 需要配置或登录

# search.failure.provider
source: Provider Error
zh_hans: 站点返回错误

# search.failure.script
source: Script Error
zh_hans: 脚本错误

# search.failure.timeout
source: Search Timed Out
zh_hans: 搜索超时

# search.failure.transport
source: Network Connection Failed
zh_hans: 网络连接失败

# search.failure.unsupported-route
source: No Search Route
zh_hans: 未提供搜索路由

# search.failure.upstream
source: Upstream Unavailable
zh_hans: 上游不可用

# search.filters.all-results
source: All Results
zh_hans: 全部结果

# search.filters.item-count
source: %@, %d items
zh_hans: %@，%d 项

# search.filters.more-providers
source: Show %d more result providers
zh_hans: 显示另外 %d 个结果来源

# search.folder.empty.message
source: This search result did not return any browsable cloud items.
zh_hans: 该搜索结果没有返回可浏览的网盘条目。

# search.folder.empty.title
source: Empty Folder
zh_hans: 目录为空

# search.folder.failed.title
source: Cloud Folder Failed to Load
zh_hans: 网盘目录加载失败

# search.folder.loading
source: Opening cloud folder…
zh_hans: 正在展开网盘目录…

# search.outcome.cancelled
source: %@ · Cancelled
zh_hans: %@ · 用户取消

# search.outcome.empty
source: %@ · Search succeeded with no results
zh_hans: %@ · 搜索成功但结果为空

# search.outcome.success
source: %@ · Search succeeded with %d results
zh_hans: %@ · 搜索成功并返回 %d 条

# search.results.title
source: Search Results
zh_hans: 搜索结果

# search.retention.complete
source: All provider results are retained
zh_hans: 完整保留各站结果

# search.retention.limited
source: Results are retained by relevance: %d total, up to %d per provider
zh_hans: 已按相关度保留结果；总量上限 %d，每站上限 %d

# search.scope.all
source: All Providers
zh_hans: 全部站点

# search.scope.all.note
source: Every runnable provider in this configuration will be searched, including providers disabled for browsing. Choose Custom to exclude any provider.
zh_hans: 当前目录中所有可运行站点都会发起搜索，包括源中标记为停用的站点；如需排除请切换到自定义。

# search.scope.choose
source: Choose providers for this search
zh_hans: 选择本次搜索使用的站点

# search.scope.custom
source: Custom
zh_hans: 自定义

# search.scope.disabled-all
source: Disabled for browsing · Still searched in All mode
zh_hans: 源中已停用 · 全部模式仍会搜索

# search.scope.disabled-custom
source: Disabled for browsing · Can be enabled for search
zh_hans: 源中已停用 · 可为搜索单独启用

# search.scope.expand.failed
source: Search Scope Was Not Expanded
zh_hans: 搜索范围未自动扩大

# search.scope.filter
source: Filter provider names
zh_hans: 筛选站点名称

# search.scope.invalid
source: The saved search scope is invalid. Select sites again.
zh_hans: 已保存的搜索范围格式无效，请重新选择站点

# search.scope.minimum-one
source: A custom search scope requires at least one currently available provider.
zh_hans: 自定义搜索范围至少需要一个当前可用站点。

# search.scope.no-available-providers
source: The current custom search scope has no available providers. Choose again.
zh_hans: 当前自定义搜索范围没有可用站点，请重新选择。

# search.scope.read.failed
source: Unable to Read Search Scope
zh_hans: 无法读取搜索范围

# search.scope.save-and-restart
source: Save and Search Again
zh_hans: 保存并重新搜索

# search.scope.save.failed
source: Unable to Save Search Scope
zh_hans: 无法保存搜索范围

# search.scope.selected-count
source: %d of %d selected
zh_hans: 已选 %d.count) / %d

# search.scope.sheet.note
source: Only selected providers receive requests. Filtering result providers does not start a new search.
zh_hans: 只会请求这里选中的站点；结果来源筛选不会发起新搜索。

# search.scope.summary.all
source: Scope: All %d
zh_hans: 范围：全部 %d

# search.scope.summary.enabled
source: Scope: %d/%d Enabled
zh_hans: 范围：已启用 %d/%d

# search.scope.summary.selected
source: Scope: %d/%d Selected
zh_hans: 范围：已选 %d/%d

# search.scope.title
source: Search Scope
zh_hans: 搜索范围

source: Search Scope Unavailable
zh_hans: 搜索范围不可用

# search.scope.value
source: Search scope: %@
zh_hans: 搜索范围：%@

# search.searching.title
source: Searching
zh_hans: 正在搜索

# search.sort.help
source: Sort: %@
zh_hans: 排序：%@

# search.sort.newest.title
source: Newest Year
zh_hans: 年份最新

# search.sort.newest.toolbar
source: Newest
zh_hans: 最新

# search.sort.relevance.title
source: Relevance
zh_hans: 相关度排序

# search.sort.relevance.toolbar
source: Relevance
zh_hans: 相关度

# search.sort.source-count.title
source: Number of Providers
zh_hans: 来源数量

# search.sort.source-count.toolbar
source: Providers
zh_hans: 来源数

# search.sort.title.title
source: Title
zh_hans: 片名排序

# search.sort.title.toolbar
source: Title
zh_hans: 片名

# search.source.accessibility
source: %@, %d providers
zh_hans: %@，%d 个来源

# search.source.choose
source: Choose a Provider
zh_hans: 选择来源

# search.source.choose-message
source: %d providers found. Choose one to view details.
zh_hans: 找到 %d 个来源，请选择一个进入详情

# search.source.close
source: Close Provider Selection
zh_hans: 关闭来源选择

# search.source.count
source: %d providers
zh_hans: %d 个来源

# search.source.open-accessibility
source: Open %@ from %@
zh_hans: 从 %@ 打开 %@

# search.source.open-from
source: Open from %@
zh_hans: 从 %@ 打开

# search.source.view-details
source: View Details
zh_hans: 进入详情

# search.status.completed
source: ✓ Completed %d/%d
zh_hans: ✓ 已完成 %d/%d

# search.status.completed-accessibility
source: Search completed; %d of %d providers processed
zh_hans: 搜索已完成，共处理 %d / %d 个站点

# search.status.details.help
source: View search progress details
zh_hans: 查看搜索进度详情

# search.status.expanded.searching
source: First pages %d/%d · Finished %d/%d
zh_hans: 首批 %d/%d · 已结束 %d/%d

# search.status.finished-count
source: Finished %d/%d
zh_hans: 已结束 %d/%d

# search.status.preparing
source: Preparing
zh_hans: 准备搜索

# search.status.preparing-accessibility
source: Preparing search
zh_hans: 正在准备搜索

# search.status.progress
source: Search Progress
zh_hans: 搜索进度

# search.status.provider-details
source: Provider Details
zh_hans: 站点详情

# search.status.result-count
source: %d results currently shown
zh_hans: 当前已显示 %d 条结果

# search.status.searching-accessibility
source: First pages completed for %d of %d providers; %d of %d providers finished
zh_hans: 首批已完成 %d / %d 个站点，站点处理已结束 %d / %d 个站点

# search.status.stopped
source: Stopped
zh_hans: 已停止

# search.status.stopped-accessibility
source: Search stopped
zh_hans: 搜索已停止

# search.status.stopped-count
source: Stopped %d/%d
zh_hans: 已停止 %d/%d

# search.status.stopped-count-accessibility
source: Search stopped; %d of %d providers processed
zh_hans: 搜索已停止，共处理 %d / %d 个站点

# search.status.title
source: Search Status
zh_hans: 搜索状态

# search.stop
source: Stop Search
zh_hans: 停止搜索

# settings.autoplay.save.failed
source: Unable to Save Auto-Play Setting
zh_hans: 无法保存连续播放设置

# settings.history.save.failed
source: Unable to Save History Setting
zh_hans: 无法保存历史设置

# settings.poster-cache.clear.failed
source: Unable to Clear Poster Cache
zh_hans: 清理海报缓存失败

# settings.privacy.save.failed
source: Unable to Save Private Mode Setting
zh_hans: 无法保存无痕设置

# settings.theme.save.failed
source: Unable to Save Theme Setting
zh_hans: 无法保存主题设置

# shortcuts.back
source: Back
zh_hans: 返回

# shortcuts.escape-search
source: Stop search; press again to return to the previous page
zh_hans: 停止搜索；再按返回进入前的页面

# shortcuts.navigation
source: Navigation
zh_hans: 导航

# shortcuts.navigation.sections
source: Browse, Live TV, Favorites, History, Settings
zh_hans: 点播、直播、收藏、历史、设置

# shortcuts.open-configurations
source: Open Video Providers
zh_hans: 打开点播配置

# shortcuts.player
source: Player
zh_hans: 播放器

# shortcuts.player.channel
source: Previous or next Live TV channel
zh_hans: 上一个或下一个直播频道

# shortcuts.player.close-window
source: Close the player window
zh_hans: 关闭播放器窗口

# shortcuts.player.episode
source: Previous or next episode
zh_hans: 上一集或下一集

# shortcuts.player.escape
source: Close the player panel or exit full screen
zh_hans: 关闭播放面板或退出全屏

# shortcuts.player.full-screen
source: Enter or exit full screen
zh_hans: 进入或退出全屏

# shortcuts.player.mute
source: Mute
zh_hans: 静音

# shortcuts.player.play-pause
source: Play or pause
zh_hans: 播放或暂停

# shortcuts.player.seek-10
source: Back or forward 10 seconds
zh_hans: 快退或快进 10 秒

# shortcuts.player.seek-30
source: Back or forward 30 seconds
zh_hans: 快退或快进 30 秒

# shortcuts.player.speed
source: Decrease or increase playback speed
zh_hans: 降低或提高播放速度

# shortcuts.player.tracks
source: Toggle subtitles / next audio track
zh_hans: 字幕开关 / 下一音轨

# shortcuts.player.volume
source: Decrease or increase volume
zh_hans: 音量减小或增大

# shortcuts.quick-switcher
source: Quickly switch configurations, providers, or Live TV sources
zh_hans: 快速切换配置、站点或直播源
